Repository: Cardiacman13/Architect
Catalog: po/*/*.po
Languages: fr

source: Usage : ./architect.sh [OPTION]
fr: Utilisation : ./architect.sh [OPTION]

source: -h --help : Display this help.
fr: -h --help : Affiche cette aide.

source: -v --verbose : Verbose mode.
fr: -v --verbose : Mode verbeux.

source: --no-reboot : Do not reboot the system at the end of the script.
fr: --no-reboot : Ne pas redémarrer le système à la fin du script.

source: ${RED}Do not run this script as root, use a user with sudo rights${RESET}
fr: ${RED}N'exécutez pas ce script en root, utilisez un utilisateur sudoer${RESET}

source: ${GREEN}Root privileges granted${RESET}
fr: ${GREEN}Privilèges d'administrateur accordés${RESET}

source: ${RED}Root privileges denied${RESET}
fr: ${RED}Privilèges d'administrateur refusés${RESET}

source: Initialization
fr: Initialisation

source: System preparation
fr: Préparation du système

source: Pacman configuration
fr: Configuration de pacman

source: AUR helper installation
fr: Installation du gestionnaire AUR

source: Mirrorlist configuration
fr: Configuration de la liste des miroirs

source: Kernel headers installation
fr: Installation des en-têtes (headers) du kernel

source: Kernel tweaks
fr: Optimisations du noyau

source: Sound server configuration
fr: Configuration du serveur son

source: System loaders configuration
fr: Configuration des chargeurs de démarrage

source: Useful package installation
fr: Installation des paquets utiles

source: sysctl kernel tweaks
fr: Optimisations sysctl du noyau

source: Firewall installation
fr: Configuration du pare-feu

source: Apparmor installation
fr: Installation d'AppArmor

source: Shell configuration
fr: Configuration du shell

source: Adding user to necessary groups
fr: Ajout de l'utilisateur aux groupes nécessaires

source: System configuration
fr: Configuration du système

source: Video drivers installation
fr: Installation des pilotes vidéo

source: Gamepad configuration
fr: Configuration des manettes

source: Printer configuration
fr: Configuration de(s) imprimante(s)

source: Bluetooth configuration
fr: Configuration du bluetooth

source: Environment configuration
fr: Configuration de l'environnement

source: Desktop environment detection
fr: Détection de l'environnement de bureau

source: Software installation
fr: Installation de logiciels

source: ${GREEN}[I]${RESET} Package ${package} is already installed.
fr: ${GREEN}[I]${RESET} Le paquet ${package} est déjà installé.

source: ${RED}(might be long)${RESET}
fr: ${RED}(peut être long)${RESET}

source: ${GREEN}[U]${RESET} Package ${package} is not installed.
fr: ${GREEN}[U]${RESET} Le paquet ${package} n'est pas installé.

source: y
fr: o

source: ${RED}Error: installation failed${RESET}
fr: ${RED}Erreur: l'installation a échoué${RESET}

source: No supported DE detected (GNOME, KDE, XFCE). Skipping DE configuration.
fr: Aucun environnement de bureau supporté détecté (GNOME, KDE, XFCE). Configuration de l'environnement de bureau ignorée.

source: Detected desktop environment:
fr: Environnement de bureau détecté :

source: Uninstall gnome-software
fr: Désinstaller gnome-software

source: Setting gtk theme to adw-gtk3
fr: Changement du thème vers adw-gtk3

source: Enabling numlock on startup
fr: Activation du verrouillage numérique au démarrage

source: Disable GDM rules to unlock Wayland
fr: Désactivation des règles GDM pour déverrouiller Wayland

source: Adding 'gnome-software' to IgnorePkg in /etc/pacman.conf
fr: Ajout de 'gnome-software' à IgnorePkg dans /etc/pacman.conf

source: Uninstall discover
fr: Désinstaller discover

source: Creating /etc/sddm.conf
fr: Création de /etc/sddm.conf

source: Setting Breeze theme for SDDM
fr: Mise en place du thème Breeze pour SDDM

source: Setting Numlock=on for SDDM
fr: Mise en place de Numlock=on pour SDDM

source: Adding 'discover' to IgnorePkg in /etc/pacman.conf
fr: Ajout de 'discover' à IgnorePkg dans /etc/pacman.conf

source: Updating user directories
fr: Mise à jour des dossiers utilisateurs

source: Done in ${GREEN}${duration}${RESET} seconds.
fr: Terminé en ${GREEN}${duration}${RESET} secondes.

source: Do you want to upload the log file to a pastebin?
fr: Voulez-vous téléverser le fichier journal vers un pastebin ?

source: Uploading log file to pastebin...
fr: Téléversement du fichier journal vers pastebin...

source: Log file uploaded to ${url}
fr: Fichier journal téléversé vers ${url}

source: ${GREEN}Script completed successfully.${RESET}
fr: ${GREEN}Script terminé avec succès.${RESET}

source: ${GREEN}Script completed successfully, the system must restart${RESET}: Press ${GREEN}Enter${RESET} to restart or ${RED}Ctrl+C${RESET} to cancel.
fr: ${GREEN}Script terminé avec succès, le système doit redémarrer${RESET}: Appuyez sur ${GREEN}Entrée${RESET} pour redémarrer ou ${RED}Ctrl+C${RESET} pour annuler.

source: ${GREEN}Restarting in ${i} seconds...${RESET}
fr: ${GREEN}Redémarrage dans ${i} secondes...${RESET}

source: Script Architect for Arch Linux
fr: Script Architect pour Arch Linux

source: ${RED}This script will make changes to your system.${RESET}
fr: ${RED}Ce script va effectuer des changements sur votre système.${RESET}

source: Some steps may take longer, depending on your Internet connection and CPU.
fr: Quelques étapes prendront peut-être plus de temps, en fonction de votre connexion Internet et de votre processeur.

source: Press ${GREEN}Enter${RESET} to continue, or ${RED}Ctrl+C${RESET} to cancel.
fr: Appuyez sur ${GREEN}Entrée${RESET} pour continuer, ou ${RED}Ctrl+C${RESET} pour annuler.

source: ${BLUE}::${RESET} Packages to install (e.g., 1 2 3, 1-3, all or press enter to skip):
fr: ${BLUE}::${RESET} Paquets à installer (e.g., 1 2 3, 1-3, tous ou appuyez sur Entrée pour passer):

source: all
fr: tous

source: Browsers
fr: Navigateurs

source: System Software
fr: Applications Système

source: Desktop Apps
fr: Applications de bureau

source: Video Software
fr: Logiciels vidéo

source: Image Editors
fr: Editeurs d'image(s)

source: Gaming Software
fr: Applications de Gaming

source: Enable arch-update.timer
fr: Activation de arch-update.timer

source: Enable arch-update tray
fr: Activation du plateau arch-update

source: Add the current user to the plugdev group
fr: Ajout de l'utilisateur actuel au groupe plugdev

source: Add the current user to the vboxusers group
fr: Ajout de l'utilisateur actuel au groupe vboxusers

source: Enable vboxweb
fr: Activation de vboxweb

source: Add the current user to the libvirt group
fr: Ajout de l'utilisateur actuel au groupe libvirt

source: Add the current user to the kvm group
fr: Ajout de l'utilisateur actuel au groupe kvm

source: Enable libvirtd
fr: Activation de libvirtd

source: Add the current user to the gamemode group
fr: Ajout de l'utilisateur actuel au groupe gamemode

source: Do you want to install apparmor security module /!\ Install and activate apparmor? This is a layer with MAC model (high security, but can cause access problems)
fr: Voulez-vous installer le module de sécurité apparmor /!\ Installer et activer apparmor ? C'est une couche avec un modèle MAC (haute sécurité, mais peut causer des problèmes d'accès)

source: No valid bootloader detected, skipping ...
fr: Aucun chargeur de démarrage valide détecté, ignoré ...

source: Type 'yes' to confirm you have read the above message:
fr: Tapez 'yes' pour confirmer que vous avez lu le message ci-dessus :

source: Please read the message carefully and type 'yes' to confirm.
fr: Veuillez lire attentivement le message et tapez 'yes' pour confirmer.

source: Skipping AppArmor installation due to invalid bootloader.
fr: Installation d'AppArmor ignorée en raison d'un chargeur de démarrage invalide.

source: Cleaning old sound server dependencies
fr: Nettoyage des dépendances de l'ancien serveur son

source: Checking if GRUB is installed
fr: Vérification de la présence de GRUB

source: Creating /etc/pacman.d/hooks
fr: Création de /etc/pacman.d/hooks

source: Setting up GRUB hook
fr: Configuration du hook GRUB

source: Enabling os-prober
fr: Activation de os-prober

source: Running os-prober
fr: Exécution d'os-prober

source: Updating GRUB
fr: Mise à jour de GRUB

source: Installing git
fr: Installation de git

source: Which AUR helper do you want to install? (yay/paru):
fr: Quel gestionnaire AUR souhaitez-vous installer ? (yay/paru) :

source: ${GREEN}You chose ${choice}${RESET}
fr: ${GREEN}Vous avez choisi ${choice}${RESET}

source: Allowing pacman without password temporarily
fr: Autorisation temporaire de pacman sans mot de passe

source: Removing temporary sudoers rule
fr: Suppression de la règle temporaire sudoers

source: Auto-updating Git-based AUR packages
fr: Mise à jour automatique des paquets AUR basés sur Git

source: Enabling SudoLoop option for yay
fr: Activation de l'option SudoLoop de yay

source: Enabling BottomUp option for paru
fr: Activation de l'option BottomUp de paru

source: Enabling SudoLoop option for paru
fr: Activation de l'option SudoLoop de paru

source: Enabling CombinedUpgrade option for paru
fr: Activation de l'option CombinedUpgrade de paru

source: Enabling UpgradeMenu option for paru
fr: Activation de l'option UpgradeMenu de paru

source: Enabling NewsOnUpgrade option for paru
fr: Activation de l'option NewsOnUpgrade de paru

source: Enabling SkipReview option for paru
fr: Activation de l'option SkipReview de paru

source: Enabling color in pacman
fr: Activation de la couleur dans pacman

source: Enabling verbose package lists in pacman
fr: Activation des listes de paquets détaillées dans pacman

source: Enabling parallel downloads and ILoveCandy in pacman
fr: Activation des téléchargements en parallèle et du ILoveCandy dans pacman

source: Enabling multilib repository
fr: Activation du dépôt multilib

source: Enabling multithread compilation
fr: Activation de la compilation multithread

source: Updating full system ${RED}(might be long)${RESET}
fr: Mise à jour du système complet ${RED}(peut être long)${RESET}

source: Installing pacman-contrib
fr: Installation de pacman-contrib

source: Enabling paccache timer
fr: Activation du timer paccache

source: Removing existing update-mirrors script
fr: Suppression du script update-mirrors existant

source: Creating update-mirrors script
fr: Création du script update-mirrors

source: Making update-mirrors script executable
fr: Rendre le script update-mirrors exécutable

source: Running update-mirrors
fr: Exécution de update-mirrors

source: Would you like to install ROCM (${RED}say No if unsure${RESET})
fr: Souhaitez-vous installer ROCM (${RED}dites Non si vous n'êtes pas sûr${RESET})

source: Do you want to use Bluetooth?
fr: Voulez-vous utiliser le bluetooth ?

source: Enabling bluetooth service
fr: Activation du service bluetooth

source: Would you want to install xpadneo? (Can improve Xbox gamepad support. ${RED}Say No if unsure.${RESET})
fr: Voulez-vous installer xpadneo ? (Peut améliorer le support des manettes xbox, ${RED}dites Non si vous n'êtes pas sûr${RESET})

source: Would you want to install Xone? (Can improve Xbox gamepad support with a USB wireless dongle. ${RED}Say No if unsure.${RESET})
fr: Voulez-vous installer Xone ? (Peut améliorer le support des manettes xbox quand elles utilisent un dongle usb sans fil, ${RED}dites Non si vous n'êtes pas sûr${RESET})

source: Do you want to use PS5 controllers?
fr: Voulez-vous utiliser des manettes PS5 ?

source: What is your graphics card type ?
fr: Quel est le type de votre carte graphique ?

source: Removing existing nvidia.conf file
fr: Suppression du fichier nvidia.conf existant

source: Setting advanced NVIDIA module options
fr: Configuration des options avancées du module NVIDIA

source: Adding NVIDIA modules to mkinitcpio.conf
fr: Ajout des modules NVIDIA à mkinitcpio.conf

source: NVIDIA modules already present in mkinitcpio.conf
fr: Les modules NVIDIA sont déjà présents dans mkinitcpio.conf

source: Removing existing NVIDIA udev rule
fr: Suppression de la règle udev NVIDIA existante

source: Creating NVIDIA udev rule for runtime power management
fr: Création de la règle udev NVIDIA pour la gestion de l'alimentation en temps réel

source: Creating pacman hook directory
fr: Création du répertoire de hooks pacman

source: Removing existing Nvidia pacman hook file
fr: Suppression du fichier de hook pacman Nvidia existant

source: Creating pacman hook for NVIDIA module regeneration
fr: Création du hook pacman pour la régénération du module NVIDIA

source: Do you have an Intel/Nvidia Laptop ?
fr: Avez-vous un portable Intel/Nvidia ?

source: Clean old nvidia drivers dependencies
fr: Nettoyage des dépendances des anciens pilotes NVIDIA

source: Enabling NVIDIA services
fr: Activation des services NVIDIA

source: Do you want to use a printer?
fr: Voulez-vous utiliser une imprimante ?

source: Do you want to use an EPSON printer?
fr: Voulez-vous utiliser une imprimante EPSON ?

source: Do you want to use a HP printer?
fr: Voulez-vous utiliser une imprimante HP ?

source: Enabling avahi-daemon service
fr: Activation du service avahi-daemon

source: Enabling cups service
fr: Activation du service cups

source: activation of vboxservice
fr: Activation du vboxservice

source: activation of VBoxClient-all
fr: Activation de VBoxClient-all

source: Would you like to install a firewall? /!\ WARNING: This script can install and enable either Firewalld or UFW. The default configuration may block local network devices such as printers or block some software functions.
fr: Voulez-vous installer un pare-feu ? /!\ ATTENTION : Ce script peut installer et activer soit Firewalld, soit UFW. La configuration par défaut peut bloquer les appareils du réseau local comme les imprimantes ou bloquer certaines fonctions logicielles.

source: Do you want to install and setup grub-btrfs and timeshift ${RED}say No if unsure${RESET} /!\ ?
fr: Voulez-vous installer et configurer grub-btrfs et timeshift ${RED}dites Non si vous n'êtes pas sûr${RESET} /!\ ?

source: Enable cronie
fr: Activation de cronie

source: Enable grub-btrfsd
fr: Activation de grub-btrfsd

source: setup grub-btrfsd for timeshift
fr: Configuration de grub-btrfsd pour timeshift

source: ${RED}Error: No Internet connection${RESET}
fr: ${RED}Erreur: Pas de connexion Internet${RESET}

source: Removing existing sysctl performance tweaks
fr: Suppression des optimisations sysctl existantes

source: Applying sysctl memory and kernel performance tweaks
fr: Application des optimisations sysctl de la mémoire et du noyau

source: Reloading sysctl parameters
fr: Rechargement des paramètres sysctl

source: What is your default shell ? (bash/zsh/fish) :
fr: Quel est votre shell par défaut ? (bash/zsh/fish) :

source: Setting default shell to zsh...
fr: Changement du shell par défaut en zsh...

source: Do you want to install oh-my-zsh ? This will install the default oh-my-zsh's .zshrc configuration
fr: Voulez-vous installer oh-my-zsh ? Cela installera la configuration .zshrc par défaut de oh-my-zsh

source: You chose to install oh-my-zsh
fr: Vous avez choisi d'installer oh-my-zsh

source: Setting default shell to fish...
fr: Changement du shell par défaut vers fish...

source: Invalid choice
fr: Choix invalide
